---
title: "More sound problems on 22.10  -- When will they get fixed?"
date: 2023-01-22
forum: Multimedia Software
---

### Post by cigtoxdoc on 2023-01-22
What is one supposed to adjust when one gets the following error?
Unit pipewire-session-manager.service failed to load properly, please adjust/correct and reload service manager: File exists)
     Active: inactive (dead)

Above was in reply to command: systemctl --user status pipewire-session-manager.service

Please note that the sound on my Dell Precision 7720 laptop worked flawlessly.  It ceased to work after booting up this morning.

All my sound applications are internet radio streaming services using the latest non-snap version of Firefox.

What commands am I supposed to use to adjust and correct pipewire-session-manager services?

Are the IT professionals at Canonical responsible for fixing the problems they created with pipewire?

John

---

### Post by #&amp;thj^% on 2023-01-22
> **cigtoxdoc said:**
> 
Are the IT professionals at Canonical responsible for fixing the problems they created with pipewire?

John
I feel I need to clear this up pipewire is not a Canonical software, we had a developer just before the launch of 22.04 thru 21.10, that just bailed out at the last minute, leaving the mess you unfortunately are in...and there is just not enough testers providing good info to work with.
FWIW: i get frustrated with broken sound as well.
This will take some time to sort out...
EDIT: See pw-cli:
```
PW-CLI(1)                   General Commands Manual                  PW-CLI(1)

NAME
       pw-cli - The PipeWire Command Line Interface

SYNOPSIS
       pw-cli [command]

DESCRIPTION
       Interact with a PipeWire instance.

       When a command is given, pw-cli will execute the command and exit

       When no command is given, pw-cli starts an interactive session with the
       default PipeWire instance pipewire-0.

       Connections to other, remote instances can be  made.  The  current  in&#8208;
       stance  name  is  displayed at the prompt. Some commands operate on the
       current instance and some on the local instance.

       Use the 'help' command to list the available commands.

GENERAL COMMANDS
       help | h
              Show a quick help on the commands available. It also  lists  the
              aliases for many commands.

       quit | q
              Exit from pw-cli

MODULE MANAGEMENT
       Modules are loaded and unloaded in the local instance, thus the pw-cli
       binary itself and can add functionality or objects to the local
       instance. It is not possible in PipeWire to load modules in another
       instance.

       load-module name [arguments...]
              Load a module specified by its name and arguments. For most mod&#8208;
              ules it is OK to be loaded more than once.

              This command returns a module variable that can be used  to  un&#8208;
              load the module.

       unload-module module-var
              Unload a module, specified either by its variable.

OBJECT INTROSPECTION
       list-objects
              List the objects of the current instance.

              Objects are listed with their id, type and version.

       info id | all
              Get information about a specific object or all objects.

              Requesting info about an object will also notify you of changes.

WORKING WITH REMOTES
       connect [remote-name]
              Connect  to  a remote instance and make this the new current in&#8208;
              stance.

              If no remote name is specified, a connection is made to the  de&#8208;
              fault remote instance, usually pipewire-0.

              This command returns a remote var that can be used to disconnect
              or switch remotes.

       disconnect [remote-var]
              Disconnect from a remote instance.

              If no remote name is specified, the current instance is  discon&#8208;
              nected.

       list-remotes
              List all remote instances.

       switch-remote [remote-var]
              Make the specified remote the current instance.

              If  no remote name is specified, the local instance is made cur&#8208;
              rent.

NODE MANAGEMENT
       create-node factory-name [properties...]
              Create a node from a factory in the current instance.

              Properties are key=value pairs separated by whitespace.

              This command returns a node variable.

       export-node node-id [remote-var]
              Export a node from the local instance to the specified instance.
              When  no instance is specified, the node will be exported to the
              current instance.

DEVICE MANAGEMENT
       create-device factory-name [properties...]
              Create a device from a factory in the current instance.

              Properties are key=value pairs separated by whitespace.

              This command returns a device variable.

LINK MANAGEMENT
       create-link node-id port-id node-id port-id [properties...]
              Create a link between 2 nodes and ports.

              Port ids can be -1 to automatically select an available port.

              Properties are key=value pairs separated by whitespace.

              This command returns a link variable.

GLOBALS MANAGEMENT
       destroy object-id
              Destroy a global object.

PARAMETER MANAGEMENT
       enum-params object-id param-id
              Enumerate params of an object.

              param-id can also be given as the param short name.

       set-param object-id param-id param-json
              Set param of an object.

              param-id can also be given as the param short name.

PERMISSION MANAGEMENT
       permissions client-id object-id permission
              Set permissions for a client.

              object-id can be -1 to set the default permissions.

       get-permissions client-id
              Get permissions of a client.

COMMAND MANAGEMENT
       send-command object-id
              Send a command to an object.

EXAMPLES
AUTHORS
       The                PipeWire                Developers                <&#8208;
       https://gitlab.freedesktop.org/pipewire/pipewire/issues>;  PipeWire  is
       available from https://pipewire.org

SEE ALSO
       pipewire(1), pw-mon(1),

                                                                     PW-CLI(1)

```

---

### Post by cigtoxdoc on 2023-01-23
Thank you, 1fallen.  How can I help with troubleshooting?  John

---

